Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/food_safety/food_safety_and_shopping.html.txt.tmx
Source language: en
Languages: ga

source: Food safety and shopping
ga: Sábháilteacht bia agus siopadóireachta

source: The Food Safety Authority of Ireland has issued some important advice for consumers when shopping
ga: Thug an tÚdarás Éireannaigh um Shábháilteacht Bia comhairle tábhachtach do thomaltóirí maidir le siopadóireacht

source: When shopping for food, there are a number of things you should look out for
ga: Nuair atá tú ag siopadóireacht le haghaidh bia, tá cúpla rud ar cheart duit breathnú amach dóibh

source: • Food from butchers or shop assistants if raw food and cooked food are not separated in the display counter
ga: • Bia ó fhreastalaithe buistéara nó siopa muna bhfuil bia amh agus bia a bhfuil cócaireacht déanta air scarrtha amach óna chéile sa chuntar taispeána

source: Similarly, you should not buy food items if the server handles raw meat or poultry and then handles cooked food using the same utensil or without washing their hands
ga: Mar a chéile níor cheart duit bia a cheannacht má tá an freastálaí ag láimhsiú feola amh nó éanlaithe agus ansin má láimhsíonn sé/sí bia a bhfuil cócaireacht déanta air ag baint úsáide as an uirlis chéanna nó muna níonn sé/sí a c(h)uid lámha

source: • Dairy products and other chilled or frozen food that is left out of fridges
ga: • Táirgí déiríochta nó reoite atá fágtha amuigh as an gcuisneoir

source: • Swollen chilled food packages and cans
ga: • Pacáistí agus cannaí bia fuar atá ataithe

source: • Leaking cartons, cans, bottles or containers
ga: • Cartáin, cannaí, buidéil nó soithigh atá ag sileadh

source: • Food products with broken or imperfect safety seals
ga: • Tairgí bia le séala sábháilteachta atá briste nó lochtach

source: • Products with moulds, discolouration or infestation
ga: • Tairgí le caonach liath, atá ag tréigeán datha nó truaillithe

source: • Products in vacuum packs, e.g. rashers and other meat products, where the pack is not tightly sealed around the food
ga: • Tairgí i bpacáistí folúis, mar shampla, slisíní bagúin agus tairgí feola eile, muna bhfuil séal daingean timpeall ar an bhia

source: Salads should be displayed in a chilled dispenser unit to keep them fresh and each salad should have its own utensil
ga: Ba cheart sailéid a chur ar taispeáint in aonad dáileora fionnuar le iad a choinneáil úr agus ba cheart go mbeadh uirlis ar leith le haghaidh gach sailéad

source: Always use a container from the dispenser or stack of containers provided
ga: Úsáid soiteach ón dáileoir i gcónaí nó ceann atá curtha ar fáil duit

source: Never touch the food with your hands and do not sneeze or cough near the food
ga: Ná bí ag láimhsiú an bhia le do chuid lámha agus ná bí ag ligeáint sraoth nó ag casachtaí timpeall ar an bhia

source: If you see anyone mis-handling the food, report it to a member of staff
ga: Má fheiceann tú éinne ag baint mí-úsáide as an bhia, cuir duine den fhoireann ar an eolas faoi

source: In addition, you should follow the supermarket's instructions carefully
ga: Freisin, ba cheart duit treoracha an ollmhargaidh a leanacht go cúramach i gcónaí

source: "Best before"/"Use by" dates
ga: Dátaí "B'fhearr roimh"/"An dáta faoinar cheart é a úsáid"

source: You should always check best before and use by dates on food, especially food with a short shelf life such as dairy products
ga: Ba cheart duit seic a dhéanamh i gcónaí ar dhátaí b'fhearr roimh agus an dáta faoinar ceart bia a úsáid, go háirithe má tá fad saoil ghearr ag bia ar nós tairgí déiríochta

source: The best before date is the date until which the food keeps its best properties, if stored properly
ga: 'Séard atá i gceist leis an "dáta b'fhearr roimh" ná go bhfuil na tréithe is fearr ag an mbia sin roimh an dáta seo, sé sin má tá sé storáilte i gceart

source: The use by date is a warning that the food should no longer be consumed or sold once the date mentioned is passed
ga: 'Séard atá i gceist leis an "dáta faoinar ceart bia a úsáid" ná rabhadh atá ann nár ceart bia a ithe ná a dhíol i ndiaidh an dáta seo

source: You should always choose refrigerated and frozen products such as meat, dairy products, deli products, ice cream and frozen meals towards the end of your shopping trip and keep them separated from hot food
ga: Nuair atá tú ag siopadóireacht ná roghnaigh bia fuar nó bia reoite ar nós feoil, tairgí déiríochta, tairgí deilí, uachtar reoite nó bia reoite go dtí deireadh an turais siopadóireachta agus coinnigh scarrtha iad ó bhia té

source: You will not be subject to the Plastic Bag Environmental Levy if you use a smaller plastic bag to store meat, fish and poultry products, regardless of whether they are packaged or unpackaged
ga: Ní bheidh Cáin Timpeallachta ar Mhálaí Plaisteacha le n-íoc agat má úsáideann tú málaí plaisteacha beaga le haghaidh tairgí feola, éisc agus éanlaithe, is cuma má tá siad i bpacáiste nó nach bhfuil

source: In addition, you will not be subject to the levy if you use plastic bags to store non-packaged food like dairy products, fruit, vegetables, nuts, confectionery, hot and cold cooked food and ice
ga: Sa bhreis ar sin, ní bheidh an cháin gearrtha ort má úsáideann tú málaí plaisteacha le haghaidh bia nach bhfuil pacáiste air ar nós tairgí déiríochta, torthaí, glasraí, cnónna, milseogra, bia fuar, bia a bhfuil cócaireacht déanta air agus oighear

source: You should avoid overloading your trolley as you may damage packaging
ga: Déan cinnte nach gcuireann tú an-iomarca sa trucail mar is féidir leat an pacáiste atá ar bhia a bhriseadh

source: Never leave your groceries in a warm car as germs multiply in warm temperatures
ga: Ná fág do chuid earraí grósaera ariamh i gcarr té mar is féidir le frídíní méadú le teocht té

source: If you are travelling a long distance, place your chilled and frozen products into a cool bag or box for the journey home - these can be purchased from many supermarkets
ga: Má tá turas fada agat, cuir do chuid tairgí fuar nó reoite i mála fionnuar nó bosca fionnuar go dtí go bhfaighidh tú abhaile - is féidir iad seo a cheannacht i go leor ollmhargaidh

source: Storing food at home
ga: Ag storáil bia sa bhaile

source: When you get home, immediately pack chilled and frozen products into the fridge or freezer
ga: Nuair a sroicheann tú an baile, cuir na táirgí fuara nó reoite isteach sa chuisneoir nó reoiteoir láithreach

source: Check the condition of frozen products and do not re-freeze them if they have thawed
ga: Breathnaigh ar na tairgí reoite agus ná déan athreo orthu má tá siad leáite

source: You should make sure your fridge temperature is below 4°C
ga: Déan cinnte go bhfuil teocht an chuisneora faoi bhun 4°C
